arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
        // Get 4 MSBs of address
        burst_access(XMEM, RX_FILTERING_CONFIG + 5 + (2*i), nullptr, (uint8_t *)&tmp, 3, true);
        reverse_memcpy((uint8_t *)&value, (const uint8_t *)&tmp, 3);
        existing_addr |= (value & 0xF) << 24;

        // Don't add a new filter if it already exists in the table
        if (existing_addr == address) {
        	DEBUG_TRACE("ArticTransceiver::add_rx_packet_filter: address=%08x already in table", address);
        	return;
        }
    }

	DEBUG_TRACE("ArticTransceiver::add_rx_packet_filter: new address=%08x added", address);

    // Add new LUT entry to end of table (24 LSBs first)
    value = address & 0xFFFFFF;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&value, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 4 + (2*lut_size), (const uint8_t *)&tmp, nullptr, 3, false);

    // Add new LUT entry to end of table (4 MSBs last)
    value = (address >> 24) & 0xF;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&value, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 5 + (2*lut_size), (const uint8_t *)&tmp, nullptr, 3, false);

    // Increment the lut_size by 1 and write back to reflect new size
    lut_size++;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&lut_size, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 3, (const uint8_t *)&tmp, nullptr, 3, false);
}


ArticTransceiver::ArticTransceiver() {
	m_pa_driver = nullptr;
    m_nrf_spim = nullptr;
    m_state = ArticTransceiverState::stopped;
    m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_EN);
}

void ArticTransceiver::power_on(
		const unsigned int argos_id,
		std::function<void(ArgosAsyncEvent)> notification_callback)
{
    DEBUG_TRACE("ArticTransceiver::power_on");

    // Device is already powered
    if (m_state != ArticTransceiverState::stopped) {
    	m_stopping = false;  // Clear any pending stopping flag
    	DEBUG_TRACE("ArticTransceiver::power_on: not disabled: state=%u", (unsigned int)m_state);
    	return;
    }

    // Set top-level state variables
    m_argos_id = argos_id;
    m_notification_callback = notification_callback;
    m_state = ArticTransceiverState::starting; // Force a reset when the task starts
    m_stopping = false;

    // Reset state variables which can be used prior to being fully programmed
    m_ack_buffer.clear();
    m_packet_buffer.clear();
    m_rx_packet.clear();

    // This will run the state machine perpetually until a power_off is called
    state_machine();
}

void ArticTransceiver::state_machine() {

	// Assume no delay between state machine invocations
	m_next_delay = 0;

	switch (m_state) {
	case ArticTransceiverState::starting:
		ARTIC_STATE_CALL(starting);
		break;
	case ArticTransceiverState::powering_on:
		ARTIC_STATE_CALL(powering_on);
		break;
	case ArticTransceiverState::reset_assert:
		ARTIC_STATE_CALL(reset_assert);
		break;
	case ArticTransceiverState::reset_deassert:
		ARTIC_STATE_CALL(reset_deassert);
		break;
	case ArticTransceiverState::dsp_reset:
		ARTIC_STATE_CALL(dsp_reset);
		break;
	case ArticTransceiverState::send_firmware_image:
		ARTIC_STATE_CALL(send_firmware_image);
		break;
	case ArticTransceiverState::wait_firmware_ready:
		ARTIC_STATE_CALL(wait_firmware_ready);
		break;
	case ArticTransceiverState::check_firmware_crc:
		ARTIC_STATE_CALL(check_firmware_crc);
		break;
	case ArticTransceiverState::idle_pending:
		ARTIC_STATE_CALL(idle_pending);
		break;
	case ArticTransceiverState::idle:
		ARTIC_STATE_CALL(idle);
		break;
	case ArticTransceiverState::receive_pending:
		ARTIC_STATE_CALL(receive_pending);
		break;
	case ArticTransceiverState::receiving:
		ARTIC_STATE_CALL(receiving);
		break;
	case ArticTransceiverState::transmit_pending:
		ARTIC_STATE_CALL(transmit_pending);
		break;
	case ArticTransceiverState::transmitting:
		ARTIC_STATE_CALL(transmitting);
		break;
	case ArticTransceiverState::error:
		ARTIC_STATE_CALL(error);
		break;
	case ArticTransceiverState::stopped:
		ARTIC_STATE_CALL(stopped);
	default:
		break;
	}

	if (!ARTIC_STATE_EQUAL(stopped)) {
		// Invoke ourselves again if we are not stopped
		//DEBUG_TRACE("ArticTransceiver::state_machine: reschedule in %u ms", m_next_delay);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "ArgosTransceiverStateMachine", Scheduler::DEFAULT_PRIORITY, m_next_delay);
	}
}

void ArticTransceiver::state_starting_enter() {
}

void ArticTransceiver::state_starting_exit() {
}

void ArticTransceiver::state_starting() {
    m_rx_packet_bits = 0;
    m_rx_total_time = 0;
    m_is_first_tx = true;
	m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
	m_pa_driver = new PADriver();
	m_rx_pending = false;
	ARTIC_STATE_CHANGE(starting, powering_on);
}

void ArticTransceiver::state_error_enter() {
	// Dump device status
	get_and_print_status();

	// The calling code's callback should call "power_off" and
	// do any necessary cleanup that it needs to otherwise
	// we will keep invoking the callback!
	m_notification_callback(ArgosAsyncEvent::ERROR);
}

void ArticTransceiver::state_error_exit() {
}

void ArticTransceiver::state_error() {
	if (m_stopping) {
		ARTIC_STATE_CHANGE(error, stopped);
	}
}

void ArticTransceiver::state_stopped_enter() {
	// Cleanup the SPIM instance
	delete m_nrf_spim;
    m_nrf_spim = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer

    // Cleanup PA driver
    delete m_pa_driver;
    m_pa_driver = nullptr;

	// FIXME: should this be moved into the NrfSPIM driver?
	nrf_gpio_cfg_output(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
	nrf_gpio_pin_clear(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.mosi_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.miso_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.sck_pin, NRF_GPIO_PIN_PULLDOWN);

