arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
    // Power down the device
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_EN);

	m_notification_callback(ArgosAsyncEvent::OFF);
}

void ArticTransceiver::state_stopped_exit() {
}

void ArticTransceiver::state_stopped() {
}

void ArticTransceiver::state_powering_on_enter() {
}

void ArticTransceiver::state_powering_on_exit() {
	m_next_delay = SAT_ARTIC_DELAY_POWER_ON_MS;
}

void ArticTransceiver::state_powering_on() {
    GPIOPins::set(BSP::GPIO::GPIO_SAT_EN);
    GPIOPins::set(BSP::GPIO::GPIO_SAT_RESET);
    ARTIC_STATE_CHANGE(powering_on, reset_assert);
}

void ArticTransceiver::state_reset_assert_enter() {
}

void ArticTransceiver::state_reset_assert_exit() {
	m_next_delay = SAT_ARTIC_DELAY_RESET_MS;
}

void ArticTransceiver::state_reset_assert() {
    GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);
    ARTIC_STATE_CHANGE(reset_assert, reset_deassert);
}

void ArticTransceiver::state_reset_deassert_enter() {
	m_next_delay = SAT_ARTIC_DELAY_RESET_MS;
}

void ArticTransceiver::state_reset_deassert_exit() {
	m_next_delay = SAT_ARTIC_DELAY_RESET_MS;
}

void ArticTransceiver::state_reset_deassert() {
    GPIOPins::set(BSP::GPIO::GPIO_SAT_RESET);
    ARTIC_STATE_CHANGE(reset_deassert, dsp_reset);
}

void ArticTransceiver::state_dsp_reset_enter() {
	m_polling_counter = 3;
}

void ArticTransceiver::state_dsp_reset_exit() {
}

void ArticTransceiver::state_dsp_reset() {
	uint32_t artic_response = 0;

	// Get DSP status
	send_artic_command(DSP_STATUS, &artic_response);
	DEBUG_TRACE("DSP_STATUS=%02x", artic_response);

	// Check response
	if (artic_response == 0x55) {
		ARTIC_STATE_CHANGE(dsp_reset, send_firmware_image);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			// Failed to reset DSP
			DEBUG_ERROR("ArticTransceiver::state_machine: DSP reset failed");
			ARTIC_STATE_CHANGE(dsp_reset, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_BOOT_MS;
	}
}

void ArticTransceiver::state_send_firmware_image_enter() {
	// Reset firmware programming state
    m_mem_sel = 0;
    m_bytes_total_read = 0;

    // Reset firmware file read position to start before reading header
    m_firmware_file.seek(0);
    m_firmware_file.read((unsigned char *)&m_firmware_header, sizeof(m_firmware_header));
}

void ArticTransceiver::state_send_firmware_image_exit() {
}

void ArticTransceiver::state_send_firmware_image() {
	// First transfer of the section?
	if (m_bytes_total_read == 0) {
		static const mem_id_t order_mode[NUM_FIRMWARE_FILES_ARTIC] = {XMEM, YMEM, PMEM};
		m_mode = order_mode[m_mem_sel];

		// Reset counters
		m_bytes_pending = 0;
		m_last_address = 0;
		m_start_address = 0;

		// Select number of transfer needed and the size of next section to transfer
		switch (m_mode)
		{
		case PMEM:
			m_size = m_firmware_header.PMEM_length;
			m_length_transfer = SIZE_SPI_REG_PMEM;
			break;
		case XMEM:
			m_size = m_firmware_header.XMEM_length;
			m_length_transfer = SIZE_SPI_REG_XMEM_YMEM_IOMEM;
			break;
		case YMEM:
			m_size = m_firmware_header.YMEM_length;
			m_length_transfer = SIZE_SPI_REG_XMEM_YMEM_IOMEM;
			break;
		case INVALID_MEM:
		case IOMEM:
		default:
			break;
		}
	}

	// Prepare next chunk to program
	while (m_bytes_total_read < m_size)
	{
		uint32_t address = 0;
		uint32_t data = 0;
		uint8_t buffer[MAXIMUM_READ_FIRMWARE_OPERATION];

		// Read 3 bytes of address and 3/4 bytes of data
		m_firmware_file.read(buffer, FIRMWARE_ADDRESS_LENGTH + m_length_transfer);

		// Check next address and next data
		std::memcpy(&address, buffer, FIRMWARE_ADDRESS_LENGTH);
		std::memcpy(&data, buffer + FIRMWARE_ADDRESS_LENGTH, m_length_transfer);

		// Sum bytes read from the file
		m_bytes_total_read += FIRMWARE_ADDRESS_LENGTH + m_length_transfer;

		//DEBUG_TRACE("ArticTransceiver::send_fw_files: mem_sel=%u pending=%u last_address=%06x address=%06x total_read=%u size=%u", m_mem_sel, m_bytes_pending, m_last_address, address, m_bytes_total_read, m_size);

		// If there is a memory discontinuity or the buffer is full send the buffer
		if ((m_last_address + 1) < address || (m_bytes_pending + m_length_transfer) >= MAX_BURST)
		{
			// Configure and send the buffer content, clear pending count
			//DEBUG_TRACE("ArticTransceiver::send_fw_files: burst_access: mode=%u start_address=%06x pending=%u", m_mode, m_start_address, m_bytes_pending);
			burst_access(m_mode, m_start_address, m_pending_buffer, nullptr, m_bytes_pending, false);
			m_start_address = address;
			m_bytes_pending = 0;

			// Copy next data into the pending buffer
			reverse_memcpy(&(m_pending_buffer[m_bytes_pending]), (uint8_t *) &data, m_length_transfer);
			m_last_address = address;
			m_bytes_pending = m_length_transfer;
			return;
		}

		// Copy next data into the pending buffer
		reverse_memcpy(&(m_pending_buffer[m_bytes_pending]), (uint8_t *) &data, m_length_transfer);
		m_last_address = address;
		m_bytes_pending += m_length_transfer;
	}

	// If there is data pending to be sent then send it before moving to the next section
	if (m_bytes_pending > 0)
	{
		//DEBUG_TRACE("ArticTransceiver::send_fw_files: burst_access: mode=%u start_address=%06x pending=%u", m_mode, m_start_address, m_bytes_pending);

		burst_access(m_mode, m_start_address, m_pending_buffer, nullptr, m_bytes_pending, false);

		// Select next file
		m_bytes_total_read = 0;
		m_mem_sel++;
	}

	// Continue running until we've programmed all files
	if (m_mem_sel >= NUM_FIRMWARE_FILES_ARTIC) {
		ARTIC_STATE_CHANGE(send_firmware_image, wait_firmware_ready);
	}
}

void ArticTransceiver::state_wait_firmware_ready_enter() {
	m_polling_counter = 100;
	send_artic_command(DSP_CONFIG, nullptr);
}

void ArticTransceiver::state_wait_firmware_ready_exit() {
}

void ArticTransceiver::state_wait_firmware_ready() {

	// Check response
	if (is_firmware_ready()) {
		ARTIC_STATE_CHANGE(wait_firmware_ready, check_firmware_crc);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			// Failed to start firmware
			DEBUG_ERROR("ArticTransceiver::state_machine: firmware did not start");
			ARTIC_STATE_CHANGE(wait_firmware_ready, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
	}
}

