arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
void ArticTransceiver::state_check_firmware_crc_enter() {
}

void ArticTransceiver::state_check_firmware_crc_exit() {
}

void ArticTransceiver::state_check_firmware_crc() {
	if (check_crc(&m_firmware_header))
		ARTIC_STATE_CHANGE(check_firmware_crc, idle);
	else {
		DEBUG_ERROR("ArticTransceiver::state_check_crc: CRC failure");
		ARTIC_STATE_CHANGE(check_firmware_crc, error);
	}
}

void ArticTransceiver::state_idle_pending_enter() {
	m_polling_counter = 100;
	send_command(ARTIC_CMD_SLEEP);
}

void ArticTransceiver::state_idle_pending_exit() {
}

void ArticTransceiver::state_idle_pending() {

	if (is_idle_state()) {
		// Clear the interrupt
        clear_interrupt(INTERRUPT_1);
        ARTIC_STATE_CHANGE(idle_pending, idle);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			// Failed to go IDLE
			DEBUG_ERROR("ArticTransceiver::state_machine: failed to enter IDLE state");
	        ARTIC_STATE_CHANGE(idle_pending, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
	}
}

void ArticTransceiver::state_idle_enter() {
	// Check if we are already IDLE or not
	if (is_idle()) {
		return;
	}

	ARTIC_STATE_CHANGE(idle, idle_pending);
}

void ArticTransceiver::state_idle_exit() {
}

void ArticTransceiver::state_idle() {
	// Check for any new commands
	if (m_packet_buffer.length()) {
		m_tx_event = ArgosAsyncEvent::TX_DONE;
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		ARTIC_STATE_CHANGE(idle, transmit_pending);
	} else if (m_ack_buffer.length()) {
		m_tx_event = ArgosAsyncEvent::ACK_DONE;
		m_tx_buffer = m_ack_buffer;
		m_ack_buffer.clear();
		ARTIC_STATE_CHANGE(idle, transmit_pending);
	} else if (m_rx_pending) {
		ARTIC_STATE_CHANGE(idle, receive_pending);
	} else if (m_stopping) {
		ARTIC_STATE_CHANGE(idle, stopped);
	}
}

void ArticTransceiver::state_receive_pending_enter() {
	m_polling_counter = 100;
	initiate_rx();
}

void ArticTransceiver::state_receive_pending_exit() {
}

void ArticTransceiver::state_receive_pending() {

	if (is_command_accepted()) {

		// Clear the interrupt
        clear_interrupt(INTERRUPT_1);

        ARTIC_STATE_CHANGE(receive_pending, receiving);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			DEBUG_ERROR("ArticTransceiver::state_machine: failed accept RX mode command");
			ARTIC_STATE_CHANGE(receive_pending, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
	}
}

void ArticTransceiver::state_receiving_enter() {
	send_command(ARTIC_CMD_START_RX_CONT);
	m_rx_timer_start = system_timer->get_counter();
}

void ArticTransceiver::state_receiving_exit() {
	m_rx_total_time += system_timer->get_counter() - m_rx_timer_start;
}

void ArticTransceiver::state_receiving() {

	// Check for any other commands that take priority over RX
	if (m_packet_buffer.length() || m_ack_buffer.length()) {
		ARTIC_STATE_CHANGE(receiving, idle); // Transition to IDLE for commands to be run
		return;
	} else if (m_stopping) {
		ARTIC_STATE_CHANGE(idle, stopped);
		return;
	}

	// Check for an RX timeout condition
	if (rtc->gettime() >= m_rx_stop_time) {
		DEBUG_TRACE("ArticTransceiver::state_receiving: timeout detected");

		// Clear any pending interrupts
	    clear_interrupt(INTERRUPT_1);

		// Initiate IDLE state
		ARTIC_STATE_CHANGE(receiving, idle);

		// Notify user of timeout condition
		m_notification_callback(ArgosAsyncEvent::RX_TIMEOUT);
		return;
	}

    // Check for valid RX message
    if (is_rx_available()) {
    	// Read packet data locally
    	bool valid_packet_available = buffer_rx_packet();

        // Clear the interrupt
        clear_interrupt(INTERRUPT_1);

        // Notify if new RX packet has been stored
        if (valid_packet_available)
        	m_notification_callback(ArgosAsyncEvent::RX_PACKET);
    }
}

void ArticTransceiver::state_transmit_pending_enter() {
	m_polling_counter = 100;
	initiate_tx();
}

void ArticTransceiver::state_transmit_pending_exit() {
}

void ArticTransceiver::state_transmit_pending() {

	if (is_command_accepted()) {

		// Clear the interrupt
        clear_interrupt(INTERRUPT_1);
        m_notification_callback(ArgosAsyncEvent::TX_STARTED);
        ARTIC_STATE_CHANGE(transmit_pending, transmitting);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			DEBUG_ERROR("ArticTransceiver::state_machine: failed accept PTT TX command");
	        ARTIC_STATE_CHANGE(transmit_pending, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
	}
}

void ArticTransceiver::state_transmitting_enter() {
	m_polling_counter = 500;
	send_command(ARTIC_CMD_START_TX_1M_SLEEP);
}

void ArticTransceiver::state_transmitting_exit() {
	m_is_first_tx = false;
	m_pa_driver->set_output_power(0);
}

void ArticTransceiver::state_transmitting() {

	if (is_tx_finished()) {
		// Clear the interrupt
        clear_interrupt(INTERRUPT_1);
        m_notification_callback(m_tx_event);
        ARTIC_STATE_CHANGE(transmitting, idle);
	} else {
		// Check retries
		if (--m_polling_counter == 0) {
			DEBUG_ERROR("ArticTransceiver::state_machine: failed to complete TX");
			ARTIC_STATE_CHANGE(transmitting, error);
		} else
			m_next_delay = SAT_ARTIC_DELAY_TICK_INTERRUPT_MS;
	}
}

void ArticTransceiver::initiate_rx() {

	// Clear pending flag
	m_rx_pending = false;

	// Add new entries for filtering on new packet types added since the firmware
	// image was released
	add_rx_packet_filter(0x000005F); // Constellation Satellite Status - format B
	add_rx_packet_filter(0x00000D4); // Satellite Orbit Parameters – format B for ANGELS
	add_rx_packet_filter(m_argos_id);

	// Initiate RX mode command
	send_command((m_rx_mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_ARGOS_3_RX_MODE : ARTIC_CMD_SET_ARGOS_4_RX_MODE);
}

void ArticTransceiver::initiate_tx() {

	// Set TCXO frequency
	unsigned int fractional_part;
	fractional_part = (unsigned int)std::round((((4.0 * m_tx_freq * 1E6) / 26E6) - 61.0) * 4194304.0);

    uint8_t write_buffer[3];
    write_buffer[0] = (fractional_part) >> 16;
    write_buffer[1] = (fractional_part) >> 8;
    write_buffer[2] = (fractional_part);

	// Only supports Argos 2 and 3 band
	burst_access(XMEM, TX_FREQUENCY_ARGOS_2_3, write_buffer, nullptr, sizeof(write_buffer), false);

	// Program TX buffer
	burst_access(XMEM, TX_PAYLOAD_ADDRESS, (const uint8_t *)&m_tx_buffer[0], nullptr, m_tx_buffer.length(), false);

	// Set TCXO warm up
	set_tcxo_warmup(m_is_first_tx ? m_tcxo_warmup_time : 0);
	set_tcxo_control(1);  // Keep TCXO on after command

