arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
	// Check which mode is required
	uint8_t cmd = (m_tx_mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_PTT_A3_TX_MODE : ARTIC_CMD_SET_PTT_A2_TX_MODE;

	// Send command to enable TX mode and start packet transfer
	send_command(cmd);
}

bool ArticTransceiver::is_firmware_ready() {
	uint32_t status = 0, required = (1<<IDLE)|(1<<RX_CALIBRATION_FINISHED);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_tx_finished() {
	uint32_t status = 0, required = (1<<TX_FINISHED);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_rx_in_progress() {
	uint32_t status = 0, required = (1<<RX_IN_PROGRESS);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_tx_in_progress() {
	uint32_t status = 0, required = (1<<TX_IN_PROGRESS);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_rx_available() {
	uint32_t status = 0, required = (1<<RX_VALID_MESSAGE);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_command_accepted() {
	uint32_t status = 0, required = (1<<MCU_COMMAND_ACCEPTED);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_idle() {
	uint32_t status = 0, required = (1<<IDLE);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

bool ArticTransceiver::is_idle_state() {
	uint32_t status = 0, required = (1<<IDLE_STATE);
    get_status_register(&status);
    //print_status(status);
    return ((status & required) == required);
}

void ArticTransceiver::read_packet(ArgosPacket& packet, unsigned int& size) {
	packet = m_rx_packet;
	size = m_rx_packet_bits;
}


bool ArticTransceiver::buffer_rx_packet() {
	uint8_t buffer[MAX_RX_SIZE_BYTES];

	// Read the entire RX payload from X memory
	burst_access(XMEM, RX_PAYLOAD_ADDRESS, nullptr, buffer, MAX_RX_SIZE_BYTES, true);

	// First 24-bit is the packet size (MSB first)
	m_rx_packet_bits = buffer[0] << 16 |
			           buffer[1] << 8 |
					   buffer[2];

	// Make sure the size is valid and does not exceed the maximum allowed size
	if (m_rx_packet_bits >= (8 * MIN_RX_SIZE_BYTES) && m_rx_packet_bits <= (8 * (MAX_RX_SIZE_BYTES-3))) {
		// Assign payload to the locally stored RX buffer
		m_rx_packet.assign((const char *)&buffer[3], (m_rx_packet_bits + 7) / 8);
		DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: data=%s", Binascii::hexlify(m_rx_packet).c_str());

		// Compute CRC16 on the payload
		unsigned int crc = CRC16::checksum(m_rx_packet, m_rx_packet_bits);
		if (crc != 0) {
			DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: discarded packet owing to bad CRC");
			return false;
		}

		return true;
	}

	DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: discarded owing to illegal size %u bits", m_rx_packet_bits);

	// Invalid contents, clear current packet
	m_rx_packet_bits = 0;
	m_rx_packet.clear();

	return false;
}

void ArticTransceiver::set_rx_mode(const ArgosMode mode, const std::time_t stop_time) {

	DEBUG_TRACE("ArticTransceiver::set_rx_mode(%u,%llu)", (unsigned int)mode, stop_time);
	m_rx_stop_time = stop_time;
	m_rx_mode = mode;
	m_rx_pending = true;
}

uint64_t ArticTransceiver::get_rx_time_on() {
	uint64_t t = m_rx_total_time;
	m_rx_total_time = 0;
	return t;
}

void ArticTransceiver::send_packet(ArgosPacket const& user_payload, unsigned int payload_length, const ArgosMode mode)
{
	ArgosPacket packet;
	unsigned int total_bits;
	unsigned int stuffing_bits = 0;

	// Only A2/A3 mode is supported
	if ((payload_length + 8) & 31) {
		// Stuff zeros at the end to align to nearest boundary
		stuffing_bits = 32 - ((payload_length + 8) % 32);
		DEBUG_TRACE("ArticTransceiver::send_packet: adding %u stuffing bits for alignment", stuffing_bits);
	}

	uint8_t length_encoded[] = { 0x0, 0x3, 0x5, 0x6, 0x9, 0xA, 0xC, 0xF };
	unsigned int length_idx = (stuffing_bits + payload_length - 8) / 32;
	unsigned int length_enc = length_encoded[length_idx];

	unsigned int num_tail_bits = 0; // A2 mode
	if (mode == ArgosMode::ARGOS_3) {
		uint8_t tail_bits[] = { 7, 8, 9, 7, 8, 9, 7, 8 };
		num_tail_bits = tail_bits[length_idx];
	}
	unsigned int op_offset = 0;
	unsigned int ip_offset = 0;

	// Transmission is:
	// MSG_LEN (4)
	// ARGOSID (28)
	// USER_PAYLOAD (n*32 - 8)
	// STUFFING_BITS
	// TAIL_BITS (7,8,9)
	total_bits = 4 + 28 + payload_length + stuffing_bits + num_tail_bits;

	// Assign the buffer to include 24-bit length indicator and rounded-up to 3 bytes for XMEM alignment
	packet.assign(((((total_bits + 24) + 23) / 24) * 24) / 8, 0);

	// Set total length
	PACK_BITS(total_bits, packet, op_offset, 24);

	// Set header
	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(m_argos_id, packet, op_offset, 28);

	// Append user payload
	unsigned int payload_bits_remaining = payload_length;
	uint8_t byte;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		EXTRACT_BITS(byte, user_payload, ip_offset, bits);
		PACK_BITS(byte, packet, op_offset, bits);
	}

	// Add any stuffing bits
	payload_bits_remaining = stuffing_bits;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		PACK_BITS(0, packet, op_offset, bits);
	}

	// Add tail bits
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup TX operation
	DEBUG_TRACE("ArticTransceiver::send_packet: data[%u]=%s tail=%u",
			total_bits, Binascii::hexlify(packet).c_str(),
			num_tail_bits);

	// Setup TX mode
	m_tx_mode = mode;
	m_packet_buffer = packet;
}


void ArticTransceiver::send_ack(const unsigned int a_dcs, const unsigned int dl_msg_id, const unsigned int exec_report, const ArgosMode mode)
{
	ArgosPacket packet, crc_packet;
	unsigned int stuffing_bits = 0;
	unsigned int payload_length = 96;
	unsigned int length_enc = 0x5;
	unsigned int service_id = 0x00EBA;
	unsigned int total_bits;

	DEBUG_TRACE("ArticTransceiver::send_ack");

	unsigned int num_tail_bits = 0; // A2 mode
	if (mode == ArgosMode::ARGOS_3)
		num_tail_bits = 7;

	// Transmission is:
	// LENGTH (24)
	// MSG_LEN (4)
	// SERVICEID (20)  + *
	// FCS (16)        |
	// ADCS (4)        | *
	// PMTID (28)      | *
	// DLMSGID (16)    | *
	// EXECRPT(4)      | *
	// DATA (28)       + *
	// STUFFING (0)
	// TAIL_BITS (7)
	total_bits = 24 + 4 + 20 + payload_length + stuffing_bits + num_tail_bits;

	unsigned int crc_offset = 0;
	unsigned int op_offset = 0;

	// Assign a temporary buffer for computing the FCS over the required* fields
	crc_packet.assign(13, 0); // 13 bytes, 100 bits
	PACK_BITS(service_id, crc_packet, crc_offset, 20);
	PACK_BITS(a_dcs, crc_packet, crc_offset, 4);
	PACK_BITS(m_argos_id, crc_packet, crc_offset, 28);
	PACK_BITS(dl_msg_id, crc_packet, crc_offset, 16);
	PACK_BITS(exec_report, crc_packet, crc_offset, 4);
	PACK_BITS(0, crc_packet, crc_offset, 28);

	// Compute FCS
	uint16_t fcs = CRC16::checksum(crc_packet, 100);

	// Assign the buffer rounded-up to 3 bytes for XMEM alignment
	packet.assign((((total_bits + 23) / 24) * 24) / 8, 0);

	PACK_BITS(total_bits, packet, op_offset, 24);
	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(service_id, packet, op_offset, 20);
	PACK_BITS(fcs, packet, op_offset, 16);
	PACK_BITS(a_dcs, packet, op_offset, 4);
	PACK_BITS(m_argos_id, packet, op_offset, 28);
	PACK_BITS(dl_msg_id, packet, op_offset, 16);
	PACK_BITS(exec_report, packet, op_offset, 4);
	PACK_BITS(0, packet, op_offset, 28);
	PACK_BITS(0, packet, op_offset, stuffing_bits);
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup ACK mode
	m_ack_mode = mode;
	m_ack_buffer = packet;
}

void ArticTransceiver::set_frequency(const double freq) {
	m_tx_freq = freq;
}

void ArticTransceiver::set_tcxo_warmup_time(const unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
}

void ArticTransceiver::set_tx_power(const BaseArgosPower power) {
#ifndef BOARD_LINKIT
	(void)power;
#else
	switch (power) {
	case BaseArgosPower::POWER_40_MW:
		m_pa_driver->set_output_power(40);
		break;
	case BaseArgosPower::POWER_500_MW:
		m_pa_driver->set_output_power(500);
		break;
	case BaseArgosPower::POWER_200_MW:
		m_pa_driver->set_output_power(200);
		break;
	case BaseArgosPower::POWER_3_MW:
		m_pa_driver->set_output_power(3);
		break;
	case BaseArgosPower::POWER_5_MW:
		m_pa_driver->set_output_power(5);
		break;
	case BaseArgosPower::POWER_50_MW:
		m_pa_driver->set_output_power(50);
		break;
	case BaseArgosPower::POWER_350_MW:
		m_pa_driver->set_output_power(350);
		break;
	case BaseArgosPower::POWER_750_MW:
		m_pa_driver->set_output_power(750);
		break;
	case BaseArgosPower::POWER_1000_MW:
		m_pa_driver->set_output_power(1000);
		break;
	case BaseArgosPower::POWER_1500_MW:
		m_pa_driver->set_output_power(1500);
		break;
	default:
		break;

	}
#endif
}
